/**
 * โจทย์ backend ข้อที่ 9
 * เขียนฟังก์ชันเพื่อหาจำนวนครั้งที่ตัวเลขในอาร์เรย์เกิดขึ้นซ้ำ
 * 
 * ตัวอย่าง
 * array = [1, 2, 2, 3, 4, 4, 4, 5]
 * 
 * ผลลัพธ์: {1: 1, 2: 2, 3: 1, 4: 3, 5: 1}
 */

arr = [1, 2, 2, 3, 4, 4, 4, 5];
function exam09(arr) {
    let obj = {}; // สร้างตัวแปร obj เพื่อเก็บค่าจำนวนครั้งที่ตัวเลขเกิดขึ้น

    for (let i = 0; i < arr.length; i++) {
        if (obj[arr[i]]) {
            obj[arr[i]]++; // ถ้าตัวเลขมีอยู่แล้ว ให้เพิ่มจำนวนครั้งที่เจอ
        } else {
            obj[arr[i]] = 1; // ถ้ายังไม่มี ให้กำหนดค่าเริ่มต้นเป็น 1
        }
    }

    return obj; // คืนค่าผลลัพธ์ที่เป็นวัตถุ
}

console.log(exam09(arr));
